Tekla.Structures.Model.IEventsInternal.AnnotationSelectionChange
The SelectionChange event is raised when the user changes the current selection of an annotation inside Tekla Structures.

Tekla.Structures.Model.IEventsInternal.HiddenObjectsChanged
Occurs when objects are hidden or view is redrawn.

Tekla.Structures.Model.IEventsInternal.TemporaryStatesChanged
Occurs when temporary states are changed.